app/controllers/dashboard_controller.rb

  def index
    @stats = {
      total_today: ResetTransaction.today.count,
      active_codes: ResetTransaction.active.count,
      expired_codes: ResetTransaction.expired.count
---
SELECT COUNT(*) FROM `reset_transactions` WHERE (created_at >= '2025-03-27 00:00:00')