app/controllers/reset_transactions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3, 2)
---
  def index
    @pagy, @transactions = pagy(ResetTransaction.includes(:user).order(created_at: :desc))

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'mercy' LIMIT 1
INSERT INTO `reset_transactions` (`user_id`, `reset_code`, `status`, `expires_at`, `location`, `date_of_birth`, `sex`, `created_at`, `updated_at`, `encrypted_reset_data`) VALUES (2, 'bN_5HaFKTKodOEsk6_iU4gy9q0sRXI6fMdos_rkbSMOBXfod3z-JoBEkUSXX0uhJI_nix8q19SqGp0-fw2G_NhQbZJlOMuvIq83xMqrLfQEqaGH_OjwK-hbMMLM2oN5PuXH5kHEN2avYfdt_biDoIw==', 0, '2025-03-29 11:01:19.992929', 'New York', '2024-03-07', 'male', '2025-03-28 11:01:19.992884', '2025-03-28 11:01:19.992884', NULL)
---
  def create
    # Find user if they exist in the system
    @user = User.find_by(username: params[:reset_transaction][:username])

    unless @user
      flash.now[:alert] = "User not found"
      return render :new, status: :unprocessable_entity
    end

    # Validate user information matches
    unless user_info_matches?(@user)
      flash.now[:alert] = "User information does not match our records"
      return render :new, status: :unprocessable_entity
    end

    # Generate reset code
    reset_code = generate_reset_code(@user)

    @transaction = @user.reset_transactions.new(
      reset_code: reset_code,
      status: :active,
      location: params[:reset_transaction][:location],
      date_of_birth: params[:reset_transaction][:date_of_birth],
      sex: params[:reset_transaction][:sex]
    )

    if @transaction.save

SELECT `reset_transactions`.* FROM `reset_transactions` WHERE `reset_transactions`.`id` = 2 LIMIT 1
---
  def set_transaction
    @transaction = ResetTransaction.find(params[:id])